app/Views/Buku/index.php

                            <?php else : ?>
                                <?php
                                    $db = \Config\Database::connect();
                                    $isPending = $db->table('peminjaman')->where('id_buku', $b['id_buku'])->where('id_user', session()->get('id_user'))->whereIn('status', ['pending', 'dipinjam'])->get()->getRow();

                                    // Cek apakah user sudah pernah pinjam & kembali untuk kasih ulasan
                                    $canReview = $db->table('peminjaman')->where('id_buku', $b['id_buku'])->where('id_user', session()->get('id_user'))->where('status', 'dikembalikan')->get()->getRow();
---
SELECT *
FROM `peminjaman`
WHERE `id_buku` = '13'
AND `id_user` = '4'
AND `status` IN ('pending','dipinjam')