app/Controllers/Buku.php

UPDATE `buku` SET `stok` = 0, `update_at` = '2026-04-17 07:23:54'
WHERE `buku`.`id_buku` IN ('11')
---
    public function ajukan($id_buku)
    {
        // 1. Cari data buku
        $buku = $this->bukuModel->find($id_buku);

        // 2. Cek apakah stok masih ada
        if ($buku['stok'] > 0) {
            // 3. Simpan data peminjaman dengan status 'pending' atau 'dipinjam'
            $this->peminjamanModel->save([
                'id_user'           => session()->get('id_user'),
                'id_buku'           => $id_buku,
                'tanggal_pengajuan' => date('Y-m-d H:i:s'),
                'status'            => 'pending'
            ]);

            // 4. KURANGI STOK DI TABEL BUKU
            $this->bukuModel->update($id_buku, [
                'stok' => $buku['stok'] - 1
            ]);

SELECT *
FROM `buku`
WHERE `buku`.`id_buku` = '13'
---
    public function pinjam($id_buku)
    {
        $buku = $this->bukuModel->find($id_buku);