app/Controllers/Buku.php

    public function index()
    {
        $keyword = $this->request->getGet('keyword');
        $kategori = $this->request->getGet('kategori');

        // Menggunakan Query Builder untuk Join Rating
        $builder = $this->bukuModel->builder();
        $builder->select('buku.*, AVG(ulasan_buku.rating) as rata_rating, COUNT(ulasan_buku.id_ulasan) as total_ulasan');
        $builder->join('ulasan_buku', 'ulasan_buku.id_buku = buku.id_buku', 'left');
        $builder->groupBy('buku.id_buku');

        if ($keyword) {
            $builder->like('buku.judul', $keyword);
        }

        if ($kategori) {
            $builder->where('buku.kategori', $kategori);
        }

        $data = [
            'title' => 'Katalog Buku',
            'buku'  => $builder->get()->getResultArray(),
            'kategori_aktif' => $kategori,
            'keyword' => $keyword
        ];
---
SELECT `buku`.*, AVG(ulasan_buku.rating) as rata_rating, COUNT(ulasan_buku.id_ulasan) as total_ulasan
FROM `buku`
LEFT JOIN `ulasan_buku` ON `ulasan_buku`.`id_buku` = `buku`.`id_buku`
GROUP BY `buku`.`id_buku`

    public function simpan()
    {
        $fileCover = $this->request->getFile('cover');
        if ($fileCover && $fileCover->getError() == 4) {
            $namaCover = 'default.jpg';
        } else {
            $namaCover = $fileCover->getRandomName();
            $fileCover->move('img', $namaCover);
        }

        $this->bukuModel->save([
            'judul'        => $this->request->getPost('judul'),
            'penulis'      => $this->request->getPost('penulis'),
            'penerbit'     => $this->request->getPost('penerbit'),
            'isbn'         => $this->request->getPost('isbn'),
            'tahun_terbit' => $this->request->getPost('tahun_terbit'),
            'ukuran_buku'  => $this->request->getPost('ukuran_buku'),
            'halaman'      => $this->request->getPost('halaman'),
            'kategori'     => $this->request->getPost('kategori'),
            'stok'         => $this->request->getPost('stok'),
            'cover'        => $namaCover
        ]);
---
INSERT INTO `buku` (`judul`, `penulis`, `penerbit`, `isbn`, `tahun_terbit`, `ukuran_buku`, `halaman`, `kategori`, `stok`, `cover`) VALUES ('esensi', 'Zaasfaldaa', '', '', '', '', '', 'Sains', '1', 'default.jpg')