app/Controllers/Dashboard.php

SELECT SUM(`stok`) AS `stok`
FROM `buku`
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
WHERE `status` = 'dipinjam'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'user'
AND `status` = 'aktif'
SELECT `peminjaman`.*, `buku`.`judul`, `users`.`nama`, `users`.`kelas`
FROM `peminjaman`
JOIN `buku` ON `buku`.`id_buku` = `peminjaman`.`id_buku`
JOIN `users` ON `users`.`id_user` = `peminjaman`.`id_user`
WHERE `peminjaman`.`status` = 'dipinjam'
AND `peminjaman`.`tanggal_kembali` <= '2026-04-21'
ORDER BY `peminjaman`.`tanggal_kembali` ASC
 LIMIT 5
---
   public function index()
{
    $db = \Config\Database::connect();

    // 1. Hitung Total Koleksi
    $totalBuku = $db->table('buku')->selectSum('stok')->get()->getRow()->stok ?? 0;

    // 2. Hitung Buku yang sedang dipinjam
    $totalDipinjam = $db->table('peminjaman')
                        ->where('status', 'dipinjam')
                        ->countAllResults();

    // 3. Hitung Siswa Aktif
    $totalSiswa = $db->table('users')
                     ->where('role', 'user')
                     ->where('status', 'aktif')
                     ->countAllResults();

    // 4. Ambil Peminjaman yang akan segera berakhir
    $deadlineAlert = date('Y-m-d', strtotime('+3 days'));

    $aktivitasMendesak = $db->table('peminjaman')
        // PERBAIKAN: Tambahkan users.kelas di select agar tidak Undefined Index
        ->select('peminjaman.*, buku.judul, users.nama, users.kelas')
        ->join('buku', 'buku.id_buku = peminjaman.id_buku')
        ->join('users', 'users.id_user = peminjaman.id_user')
        ->where('peminjaman.status', 'dipinjam')
        ->where('peminjaman.tanggal_kembali <=', $deadlineAlert)
        ->orderBy('peminjaman.tanggal_kembali', 'ASC')
        ->limit(5)
        ->get()->getResultArray();