app/Controllers/Favorite.php

SELECT *
FROM `favorite`
JOIN `buku` ON `buku`.`id_buku` = `favorite`.`id_buku`
WHERE `favorite`.`id_user` = '4'
---
    public function index()
    {
        $id_user = session()->get('id_user');
        if (!$id_user) return redirect()->to('login');

        $data['buku_favorite'] = $this->db->table('favorite')
            ->join('buku', 'buku.id_buku = favorite.id_buku')
            ->where('favorite.id_user', $id_user)
            ->get()->getResultArray();