app/Controllers/Peminjaman.php

    public function index()
    {
        $db = \Config\Database::connect();

        // Ambil data peminjaman dengan join ke buku dan users
        $builder = $db->table('peminjaman');
        $builder->select('peminjaman.*, buku.judul, users.nama');
        $builder->join('buku', 'buku.id_buku = peminjaman.id_buku');
        $builder->join('users', 'users.id_user = peminjaman.id_user');
        $builder->orderBy('peminjaman.id_pinjam', 'DESC');

        $data = [
            'title'      => 'Daftar Transaksi Peminjaman',
            'peminjaman' => $builder->get()->getResultArray()
        ];
---
SELECT *
FROM `peminjaman`
WHERE `peminjaman`.`id_pinjam` = '45'
SELECT `peminjaman`.*, `buku`.`judul`, `users`.`nama`
FROM `peminjaman`
JOIN `buku` ON `buku`.`id_buku` = `peminjaman`.`id_buku`
JOIN `users` ON `users`.`id_user` = `peminjaman`.`id_user`
ORDER BY `peminjaman`.`id_pinjam` DESC

    public function konfirmasi($id, $aksi)
    {
        // Hanya Admin yang boleh mengakses fungsi ini
        if (session()->get('role') != 'admin') {
            return redirect()->to('/buku')->with('error', 'Akses ditolak!');
        }

        $dataPinjam = $this->peminjamanModel->find($id);
        if (!$dataPinjam) {
            return redirect()->back()->with('error', 'Data tidak ditemukan.');
        }

        if ($aksi == 'setuju') {
            $this->peminjamanModel->update($id, [
                'status'         => 'dipinjam',
                'tanggal_pinjam' => date('Y-m-d H:i:s'),
            ]);

            // Stok berkurang otomatis saat disetujui
            $buku = $this->bukuModel->find($dataPinjam['id_buku']);
            $this->bukuModel->update($dataPinjam['id_buku'], [
                'stok' => $buku['stok'] - 1
            ]);
---
UPDATE `peminjaman` SET `status` = 'dipinjam', `tanggal_pinjam` = '2026-04-17 07:24:14'
WHERE `peminjaman`.`id_pinjam` IN ('45')
SELECT *
FROM `buku`
WHERE `buku`.`id_buku` = '11'
UPDATE `buku` SET `stok` = -1, `update_at` = '2026-04-17 07:24:14'
WHERE `buku`.`id_buku` IN ('11')

public function tambah()
    {
        // Jika Anda belum punya UserModel, buat dulu atau gunakan query manual
        $userModel = new \App\Models\UsersModel();

        $data = [
            'title' => 'Form Peminjaman Baru',
            'users' => $userModel->findAll(), // Mengambil data user untuk dropdown
            'buku'  => $this->bukuModel->where('stok >', 0)->findAll() // Hanya buku yang ada stok
---
SELECT *
FROM `users`
SELECT *
FROM `buku`
WHERE `stok` > 0

    public function proses_kembali($id)
    {
        if (session()->get('role') != 'admin') {
            return redirect()->back()->with('error', 'Hanya admin yang bisa memproses pengembalian.');
        }

        $dataPinjam = $this->peminjamanModel->find($id);

        $this->peminjamanModel->update($id, [
            'tanggal_kembali' => date('Y-m-d H:i:s'),
            'status'          => 'dikembalikan'
        ]);

        // Kembalikan stok buku
        $buku = $this->bukuModel->find($dataPinjam['id_buku']);
        $this->bukuModel->update($dataPinjam['id_buku'], [
            'stok' => $buku['stok'] + 1
        ]);
---
UPDATE `peminjaman` SET `tanggal_kembali` = '2026-04-18 16:36:54', `status` = 'dikembalikan', `denda` = '5.000'
WHERE `peminjaman`.`id_pinjam` IN ('51')
SELECT *
FROM `buku`
WHERE `buku`.`id_buku` = '12'
UPDATE `buku` SET `stok` = 8
WHERE `buku`.`id_buku` IN ('12')